# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd
import zipfile

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here

In [3]:
with zipfile.ZipFile('Orders.zip','r') as zip_ref:
    print(zip_ref.namelist())

['Orders.csv']

In [4]:
with zipfile.ZipFile('Orders.zip','r') as zip_ref:
    zip_ref.extract('Orders.csv')

In [5]:
orders = pd.read_csv('Orders.csv')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [6]:
# your code here

In [7]:
# How to aggregate the amount_spent for unique customers?

In [8]:
grouped_customerID = orders.groupby('CustomerID')
grouped_customerID

In [9]:
aggregated_customer_spent = grouped_customerID['amount_spent'].sum()
aggregated_customer_spent

CustomerID
12346    77183.60
12347     4310.00
12348     1797.24
12349     1757.55
12350      334.40
           ...
18280      180.60
18281       80.82
18282      178.05
18283     2094.88
18287     1837.28
Name: amount_spent, Length: 4339, dtype: float64

In [10]:
aggregated_customer_spent = aggregated_customer_spent.reset_index()
aggregated_customer_spent

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
4          12350        334.40
...          ...           ...
4334       18280        180.60
4335       18281         80.82
4336       18282        178.05
4337       18283       2094.88
4338       18287       1837.28

[4339 rows x 2 columns]

In [11]:
aggregated_customer_spent = aggregated_customer_spent.rename (columns={'CustomerID':'CustomerID',
                                                              'amount_spent':'total_amount_spent'})
                                                              
aggregated_customer_spent

      CustomerID  total_amount_spent
0          12346            77183.60
1          12347             4310.00
2          12348             1797.24
3          12349             1757.55
4          12350              334.40
...          ...                 ...
4334       18280              180.60
4335       18281               80.82
4336       18282              178.05
4337       18283             2094.88
4338       18287             1837.28

[4339 rows x 2 columns]

In [12]:
# How to select customers whose aggregated amount_spent is in a given quantile range

In [13]:
vip_quantile_range = (0.95,1.0)
preferred_quantile_range = (0.75,0.95)

In [14]:
VIP_lower = aggregated_customer_spent['total_amount_spent'].quantile(vip_quantile_range[0])
VIP_upper = aggregated_customer_spent['total_amount_spent'].quantile(vip_quantile_range[1])

In [16]:
VIP_customers = aggregated_customer_spent[aggregated_customer_spent['total_amount_spent'].between(VIP_lower,VIP_upper,
                                                                                                 inclusive=False)]
VIP_customers

/var/folders/v0/dptd1l097cx_4zqpm8ddy2rm0000gn/T/ipykernel_30531/4071905169.py:1: FutureWarning: Boolean inputs to the `inclusive` argument are deprecated in favour of `both` or `neither`.
  VIP_customers = aggregated_customer_spent[aggregated_customer_spent['total_amount_spent'].between(VIP_lower,VIP_upper,

      CustomerID  total_amount_spent
0          12346            77183.60
10         12357             6207.67
12         12359             6372.58
50         12409            11072.67
55         12415           124914.53
...          ...                 ...
4207       18109             8052.97
4229       18139             8438.34
4253       18172             7561.68
4292       18223             6484.54
4298       18229             7276.90

[216 rows x 2 columns]

In [17]:
preferred_lower =  aggregated_customer_spent['total_amount_spent'].quantile(preferred_quantile_range[0])
preferred_upper =  aggregated_customer_spent['total_amount_spent'].quantile(preferred_quantile_range[1])

In [18]:
preferred_customers = aggregated_customer_spent[aggregated_customer_spent['total_amount_spent'].between(preferred_lower,preferred_upper,
                                                                                          inclusive=True)]
preferred_customers

/var/folders/v0/dptd1l097cx_4zqpm8ddy2rm0000gn/T/ipykernel_30531/546932190.py:1: FutureWarning: Boolean inputs to the `inclusive` argument are deprecated in favour of `both` or `neither`.
  preferred_customers = aggregated_customer_spent[aggregated_customer_spent['total_amount_spent'].between(preferred_lower,preferred_upper,

      CustomerID  total_amount_spent
1          12347             4310.00
2          12348             1797.24
3          12349             1757.55
5          12352             2506.04
9          12356             2811.43
...          ...                 ...
4319       18259             2338.60
4320       18260             2643.20
4328       18272             3078.58
4337       18283             2094.88
4338       18287             1837.28

[868 rows x 2 columns]

In [19]:
preferred_customers=preferred_customers.assign(customer_type="preferred")
preferred_customers

      CustomerID  total_amount_spent customer_type
1          12347             4310.00     preferred
2          12348             1797.24     preferred
3          12349             1757.55     preferred
5          12352             2506.04     preferred
9          12356             2811.43     preferred
...          ...                 ...           ...
4319       18259             2338.60     preferred
4320       18260             2643.20     preferred
4328       18272             3078.58     preferred
4337       18283             2094.88     preferred
4338       18287             1837.28     preferred

[868 rows x 3 columns]

In [20]:
VIP_customers=VIP_customers.assign(customer_type='VIP')

In [21]:
VIP_customers

      CustomerID  total_amount_spent customer_type
0          12346            77183.60           VIP
10         12357             6207.67           VIP
12         12359             6372.58           VIP
50         12409            11072.67           VIP
55         12415           124914.53           VIP
...          ...                 ...           ...
4207       18109             8052.97           VIP
4229       18139             8438.34           VIP
4253       18172             7561.68           VIP
4292       18223             6484.54           VIP
4298       18229             7276.90           VIP

[216 rows x 3 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [ ]:
# your code here

In [22]:
VIP_customers_info = pd.merge(VIP_customers,orders[['CustomerID','Country']], on='CustomerID')
VIP_customers_info

        CustomerID  total_amount_spent customer_type         Country
0            12346            77183.60           VIP  United Kingdom
1            12357             6207.67           VIP     Switzerland
2            12357             6207.67           VIP     Switzerland
3            12357             6207.67           VIP     Switzerland
4            12357             6207.67           VIP     Switzerland
...            ...                 ...           ...             ...
102399       18229             7276.90           VIP  United Kingdom
102400       18229             7276.90           VIP  United Kingdom
102401       18229             7276.90           VIP  United Kingdom
102402       18229             7276.90           VIP  United Kingdom
102403       18229             7276.90           VIP  United Kingdom

[102404 rows x 4 columns]

In [23]:
VIP_customers_info_groupby = VIP_customers_info.groupby('Country')
VIP_customers_info_groupby

In [24]:
VIP_customer_country = VIP_customers_info_groupby['customer_type'].count()
VIP_customer_country

Country
Australia            898
Belgium               54
Channel Islands      364
Cyprus               248
Denmark               36
EIRE                7077
Finland              294
France              3290
Germany             3127
Japan                205
Norway               420
Portugal             681
Singapore            222
Spain                511
Sweden               198
Switzerland          594
United Kingdom     84185
Name: customer_type, dtype: int64

In [25]:
Top_country_VIP_customer = VIP_customer_country.idxmax()
Top_country_VIP_customer

'United Kingdom'

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [ ]:
# your code here

In [26]:
preferred_customers_info = pd.merge(preferred_customers,orders[['CustomerID','Country']], on='CustomerID')
preferred_customers_info

        CustomerID  total_amount_spent customer_type         Country
0            12347             4310.00     preferred         Iceland
1            12347             4310.00     preferred         Iceland
2            12347             4310.00     preferred         Iceland
3            12347             4310.00     preferred         Iceland
4            12347             4310.00     preferred         Iceland
...            ...                 ...           ...             ...
151776       18287             1837.28     preferred  United Kingdom
151777       18287             1837.28     preferred  United Kingdom
151778       18287             1837.28     preferred  United Kingdom
151779       18287             1837.28     preferred  United Kingdom
151780       18287             1837.28     preferred  United Kingdom

[151781 rows x 4 columns]

In [27]:
print(type(preferred_customers_info))
print(type(VIP_customers_info))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [28]:
VIP_and_preferred_customers = pd.concat([preferred_customers_info,VIP_customers_info],ignore_index=True)

In [29]:
country_group = VIP_and_preferred_customers.groupby(['Country','customer_type']).size().reset_index(name='counts')

In [30]:
country_group = country_group.sort_values(by='counts',ascending=False)
country_group.head(1)

           Country customer_type  counts
41  United Kingdom     preferred  137450